In [1]:
import pandas as pd

In [3]:
df1=pd.DataFrame({"date":["6/1/2010","6/2/2010","6/3/2010","6/4/2010","6/5/2010"],
                  "city":["London","Birmingham","Manchester","Liverpool","Bradford"],
                  "temperature":[10,7,8,9,11],
                  "humidity":[20,12,13,14,17]})

In [5]:
df1["code"]=["LN", "BM", "MN", "LV", "BD"]

In [8]:
df1["code"].is_unique

True

In [11]:
df1.set_index("code", inplace=True)

In [12]:
df1

          date        city  temperature  humidity
code
LN    6/1/2010      London           10        20
BM    6/2/2010  Birmingham            7        12
MN    6/3/2010  Manchester            8        13
LV    6/4/2010   Liverpool            9        14
BD    6/5/2010    Bradford           11        17

In [15]:
df1["city"].add("Sandwell")

code
LN        LondonSandwell
BM    BirminghamSandwell
MN    ManchesterSandwell
LV     LiverpoolSandwell
BD      BradfordSandwell
Name: city, dtype: object

In [16]:
df1

          date        city  temperature  humidity
code
LN    6/1/2010      London           10        20
BM    6/2/2010  Birmingham            7        12
MN    6/3/2010  Manchester            8        13
LV    6/4/2010   Liverpool            9        14
BD    6/5/2010    Bradford           11        17

In [18]:
df1.pivot(index="date", columns="city") #pivot makes in this below designwe can set city name column name

         temperature                                        humidity           \
city      Birmingham Bradford Liverpool London Manchester Birmingham Bradford
date
6/1/2010         NaN      NaN       NaN   10.0        NaN        NaN      NaN
6/2/2010         7.0      NaN       NaN    NaN        NaN       12.0      NaN
6/3/2010         NaN      NaN       NaN    NaN        8.0        NaN      NaN
6/4/2010         NaN      NaN       9.0    NaN        NaN        NaN      NaN
6/5/2010         NaN     11.0       NaN    NaN        NaN        NaN     17.0


city     Liverpool London Manchester
date
6/1/2010       NaN   20.0        NaN
6/2/2010       NaN    NaN        NaN
6/3/2010       NaN    NaN       13.0
6/4/2010      14.0    NaN        NaN
6/5/2010       NaN    NaN        NaN